app/controllers/gallery_controller.rb

	def index
		@pictures = Picture.order('created_at DESC').all
---
SELECT "pictures".* FROM "pictures" ORDER BY created_at DESC

	def create
		@picture = Picture.new(picture_params)


		if @picture.save
---
INSERT INTO "pictures" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", ""], ["created_at", 2017-03-02 17:11:07 UTC], ["updated_at", 2017-03-02 17:11:07 UTC]]

    def destroy
	    picture.find(params[:picture_id]).destroy
---
DELETE FROM "pictures" WHERE "pictures"."id" = $1  [["id", 3]]