app/controllers/projects_controller.rb

	def index
		@projects = Project.order('created_at DESC').all
---
SELECT "projects".* FROM "projects" ORDER BY created_at DESC

	def create
		@project = Project.new(project_params)


		if @project.save
---
INSERT INTO "projects" ("link", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["link", "www.google.com"], ["name", "Projekt"], ["created_at", 2017-03-02 18:18:46 UTC], ["updated_at", 2017-03-02 18:18:46 UTC]]

    def destroy
	    Project.find(params[:project_id]).destroy
---
DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 1]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]